var surah_1 = {
    "id": 1, "name": "الفاتحة",
    "verses": [
        {"id": 1, "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ"},
        {"id": 2, "text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"},
        {"id": 3, "text": "الرَّحْمَٰنِ الرَّحِيمِ"},
        {"id": 4, "text": "مَالِكِ يَوْمِ الدِّينِ"},
        {"id": 5, "text": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ"},
        {"id": 6, "text": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ"},
        {"id": 7, "text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"}
    ],
    "tafsir": [
        {"verses": "1-7", "explanation": "تبدأ السورة باسم الله الرحمن الرحيم. فكل حمد وثناء فهو لله رب الخلائق أجمعين، وهو الرحمن الذي وسعت رحمته كل شيء، الرحيم بالمؤمنين. وهو وحده مالك يوم القيامة، يوم الحساب والجزاء. نخصك وحدك بالعبادة ونطلب منك وحدك العون في كل أمورنا. دلنا وأرشدنا إلى الطريق المستقيم، طريق الذين أنعمت عليهم من النبيين والصديقين والشهداء والصالحين، غير طريق الذين غضبت عليهم وهم اليهود، وغير طريق الذين ضلوا عن الحق وهم النصارى."}
    ],
    "vocabulary": [
        {"id": 1, "word": "الْعَالَمِينَ", "meaning": "جميع الخلائق"},
        {"id": 2, "word": "يَوْمِ الدِّينِ", "meaning": "يوم الجزاء والحساب"},
        {"id": 3, "word": "نَسْتَعِينُ", "meaning": "نطلب العون والمساعدة"},
        {"id": 4, "word": "اهْدِنَا", "meaning": "أرشدنا ودلنا"},
        {"id": 5, "word": "الصِّرَاطَ الْمُسْتَقِيمَ", "meaning": "الطريق الواضح وهو الإسلام"},
        {"id": 6, "word": "الْمَغْضُوبِ عَلَيْهِمْ", "meaning": "اليهود"},
        {"id": 7, "word": "الضَّالِّينَ", "meaning": "النصارى"}
    ]
}
