var surah_103 = {
    "id": 103,
    "name": "العصر",
    "verses": [
        {
            "id": 1,
            "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ وَٱلْعَصْرِ"
        },
        {
            "id": 2,
            "text": "إِنَّ ٱلْإِنسَـٰنَ لَفِى خُسْرٍ"
        },
        {
            "id": 3,
            "text": "إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَتَوَاصَوْا۟ بِٱلْحَقِّ وَتَوَاصَوْا۟ بِٱلصَّبْرِ"
        }
    ],
    "tafsir": [
        {
            "verses": "1-3",
            "explanation": "يقسم الله بالدهر على أن الإنسان في هلاك وخسران، إلا الذين آمنوا بالله وعملوا الأعمال الصالحة، وأوصى بعضهم بعضًا بالتمسك بالحق والصبر على طاعة الله وعن معصيته."
        }
    ],
    "vocabulary": [
        {
            "id": 1,
            "word": "وَالْعَصْرِ",
            "meaning": "الدهر أو الزمان"
        },
        {
            "id": 2,
            "word": "خُسْرٍ",
            "meaning": "خسارة وهلاك"
        },
        {
            "id": 3,
            "word": "وَتَوَاصَوْا",
            "meaning": "أوصى بعضهم بعضًا"
        }
    ]
};