var surah_103 = {
    "id": 103, "name": "العصر",
    "verses": [
        {"id": 1, "text": "وَالْعَصْرِ"},
        {"id": 2, "text": "إِنَّ الْإِنسَانَ لَفِي خُسْرٍ"},
        {"id": 3, "text": "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ"}
    ],
    "tafsir": [
        {"verses": "1-3", "explanation": "يقسم الله بالدهر على أن الإنسان في هلاك وخسران، إلا الذين آمنوا بالله وعملوا الأعمال الصالحة، وأوصى بعضهم بعضًا بالتمسك بالحق والصبر على طاعة الله وعن معصيته."}
    ],
    "vocabulary": [
        {"id": 1, "word": "وَالْعَصْرِ", "meaning": "الدهر أو الزمان"},
        {"id": 2, "word": "خُسْرٍ", "meaning": "خسارة وهلاك"},
        {"id": 3, "word": "وَتَوَاصَوْا", "meaning": "أوصى بعضهم بعضًا"}
    ]
}
