var surah_106 = {
    "id": 106, "name": "قريش",
    "verses": [
        {"id": 1, "text": "لِإِيلَافِ قُرَيْشٍ"},
        {"id": 2, "text": "إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ"},
        {"id": 3, "text": "فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ"},
        {"id": 4, "text": "الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ"}
    ],
    "tafsir": [
        {"verses": "1-4", "explanation": "يذكر الله نعمه على قبيلة قريش، حيث جعلهم يعتادون رحلتيهم التجاريتين في الشتاء إلى اليمن وفي الصيف إلى الشام بأمان. ويأمرهم بأن يعبدوا رب الكعبة الذي رزقهم وأطعمهم من الجوع، وآمنهم من الخوف بفضله وحمايته لبيته الحرام."}
    ],
    "vocabulary": [
        {"id": 1, "word": "لِإِيلَافِ", "meaning": "لما اعتادوه وألفوه"},
        {"id": 2, "word": "رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ", "meaning": "رحلة التجارة إلى اليمن شتاءً وإلى الشام صيفًا"},
        {"id": 3, "word": "هَٰذَا الْبَيْتِ", "meaning": "الكعبة المشرفة"}
    ]
}
