var surah_107 = {
    "id": 107, "name": "الماعون",
    "verses": [
        {"id": 1, "text": "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ"},
        {"id": 2, "text": "فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ"},
        {"id": 3, "text": "وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ"},
        {"id": 4, "text": "فَوَيْلٌ لِّلْمُصَلِّينَ"},
        {"id": 5, "text": "الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ"},
        {"id": 6, "text": "الَّذِينَ هُمْ يُرَاءُونَ"},
        {"id": 7, "text": "وَيَمْنَعُونَ الْمَاعُونَ"}
    ],
    "tafsir": [
        {"verses": "1-7", "explanation": "تصف السورة صفات من يكذب بيوم الجزاء، فهو الذي يدفع اليتيم بعنف، ولا يحث غيره على إطعام الفقير. ثم تتوعد المصلين الذين يؤخرون الصلاة عن وقتها، ويصلون مراءاة للناس، ويمنعون إعارة الأشياء البسيطة التي لا تضر إعارتها."}
    ],
    "vocabulary": [
        {"id": 1, "word": "بِالدِّينِ", "meaning": "بالجزاء والحساب يوم القيامة"},
        {"id": 2, "word": "يَدُعُّ الْيَتِيمَ", "meaning": "يدفع اليتيم بعنف وغلظة"},
        {"id": 3, "word": "يَحُضُّ", "meaning": "يحث ويشجع"},
        {"id": 4, "word": "سَاهُونَ", "meaning": "غافلون ومؤخرون لها عن وقتها"},
        {"id": 5, "word": "يُرَاءُونَ", "meaning": "يفعلون الخير ليراهم الناس"},
        {"id": 6, "word": "الْمَاعُونَ", "meaning": "ما يستعيره الناس من أشياء صغيرة"}
    ]
}
