var surah_109 = {
    "id": 109, "name": "الكافرون",
    "verses": [
        {"id": 1, "text": "قُلْ يَا أَيُّهَا الْكَافِرُونَ"},
        {"id": 2, "text": "لَا أَعْبُدُ مَا تَعْبُدُونَ"},
        {"id": 3, "text": "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ"},
        {"id": 4, "text": "وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ"},
        {"id": 5, "text": "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ"},
        {"id": 6, "text": "لَكُمْ دِينُكُمْ وَلِيَ دِينِ"}
    ],
    "tafsir": [
        {"verses": "1-6", "explanation": "يأمر الله نبيه بأن يعلن البراءة من دين المشركين، فيقول لهم: أنا لا أعبد أصنامكم التي تعبدونها، وأنتم لا تعبدون الله الذي أعبده. ويؤكد على هذا الانفصال التام في العبادة، ويختم بأن لكم دينكم الباطل ولي ديني الحق."}
    ],
    "vocabulary": [
        {"id": 1, "word": "لَكُمْ دِينُكُمْ", "meaning": "لكم شرككم وكفركم"},
        {"id": 2, "word": "وَلِيَ دِينِ", "meaning": "ولي توحيدي وإسلامي"}
    ]
}
