var surah_110 = {
    "id": 110,
    "name": "النصر",
    "verses": [
        {
            "id": 1,
            "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ إِذَا جَآءَ نَصْرُ ٱللَّهِ وَٱلْفَتْحُ"
        },
        {
            "id": 2,
            "text": "وَرَأَيْتَ ٱلنَّاسَ يَدْخُلُونَ فِى دِينِ ٱللَّهِ أَفْوَاجًا"
        },
        {
            "id": 3,
            "text": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَٱسْتَغْفِرْهُ ۚ إِنَّهُۥ كَانَ تَوَّابًۢا"
        }
    ],
    "tafsir": [
        {
            "verses": "1-3",
            "explanation": "تبشر السورة النبي محمدًا صلى الله عليه وسلم بنصر الله وفتح مكة، ودخول الناس في الإسلام جماعات. وتأمره بأن يشكر الله على هذه النعمة بالتسبيح والحمد والاستغفار، فالله كثير التوبة على عباده."
        }
    ],
    "vocabulary": [
        {
            "id": 1,
            "word": "الْفَتْحُ",
            "meaning": "فتح مكة"
        },
        {
            "id": 2,
            "word": "أَفْوَاجًا",
            "meaning": "جماعات كثيرة"
        },
        {
            "id": 3,
            "word": "تَوَّابًا",
            "meaning": "كثير القبول لتوبة عباده"
        }
    ]
};