var surah_111 = {
    "id": 111,
    "name": "المسد",
    "verses": [
        {
            "id": 1,
            "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ تَبَّتْ يَدَآ أَبِى لَهَبٍ وَتَبَّ"
        },
        {
            "id": 2,
            "text": "مَآ أَغْنَىٰ عَنْهُ مَالُهُۥ وَمَا كَسَبَ"
        },
        {
            "id": 3,
            "text": "سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ"
        },
        {
            "id": 4,
            "text": "وَٱمْرَأَتُهُۥ حَمَّالَةَ ٱلْحَطَبِ"
        },
        {
            "id": 5,
            "text": "فِى جِيدِهَا حَبْلٌ مِّن مَّسَدٍۭ"
        }
    ],
    "tafsir": [
        {
            "verses": "1-5",
            "explanation": "تتوعد السورة أبا لهب، عم النبي، بالهلاك والخسران. فلن ينفعه ماله ولا جاهه، وسيدخل نارًا شديدة، ومعه زوجته التي كانت تؤذي النبي، وفي عنقها حبل من ليف خشن تُعذب به."
        }
    ],
    "vocabulary": [
        {
            "id": 1,
            "word": "تَبَّتْ",
            "meaning": "هلكت وخسرت"
        },
        {
            "id": 2,
            "word": "سَيَصْلَىٰ",
            "meaning": "سيدخل ويقاسي حرها"
        },
        {
            "id": 3,
            "word": "حَمَّالَةَ الْحَطَبِ",
            "meaning": "كانت تحمل الشوك وتضعه في طريق النبي"
        },
        {
            "id": 4,
            "word": "جِيدِهَا",
            "meaning": "عنقها"
        },
        {
            "id": 5,
            "word": "مَّسَدٍ",
            "meaning": "ليف خشن قوي"
        }
    ]
};