var surah_112 = {
    "id": 112,
    "name": "الإخلاص",
    "verses": [
        {
            "id": 1,
            "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ قُلْ هُوَ ٱللَّهُ أَحَدٌ"
        },
        {
            "id": 2,
            "text": "ٱللَّهُ ٱلصَّمَدُ"
        },
        {
            "id": 3,
            "text": "لَمْ يَلِدْ وَلَمْ يُولَدْ"
        },
        {
            "id": 4,
            "text": "وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ"
        }
    ],
    "tafsir": [
        {
            "verses": "1-4",
            "explanation": "تصف السورة وحدانية الله تعالى، فهو واحد لا شريك له، وهو الذي تقصده الخلائق في حوائجها. وهو منزه عن أن يكون له ولد أو والد، وليس له مثيل أو شبيه."
        }
    ],
    "vocabulary": [
        {
            "id": 1,
            "word": "أَحَدٌ",
            "meaning": "واحد لا شريك له"
        },
        {
            "id": 2,
            "word": "الصَّمَدُ",
            "meaning": "السيد الذي يُقصد في الحوائج"
        },
        {
            "id": 3,
            "word": "كُفُوًا",
            "meaning": "مثيلاً أو نظيرًا"
        }
    ]
};