var surah_114 = {
    "id": 114, "name": "الناس",
    "verses": [
        {"id": 1, "text": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ"},
        {"id": 2, "text": "مَلِكِ النَّاسِ"},
        {"id": 3, "text": "إِلَٰهِ النَّاسِ"},
        {"id": 4, "text": "مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"},
        {"id": 5, "text": "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"},
        {"id": 6, "text": "مِنَ الْجِنَّةِ وَالنَّاسِ"}
    ],
    "tafsir": [
        {"verses": "1-6", "explanation": "يأمر الله نبيه بأن يستجير برب الناس ومالكهم وإلههم الحق، من شر الشيطان الذي يوسوس بالشر ويختفي عند ذكر الله، والذي يلقي وساوسه في قلوب الناس، سواء كان من شياطين الجن أو شياطين الإنس."}
    ],
    "vocabulary": [
        {"id": 1, "word": "الْوَسْوَاسِ", "meaning": "الشيطان الذي يوسوس بالشر"},
        {"id": 2, "word": "الْخَنَّاسِ", "meaning": "الذي يختفي ويتأخر عند ذكر الله"}
    ]
}
