var surah_97 = {
    "id": 97, "name": "القدر",
    "verses": [
        {"id": 1, "text": "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ"},
        {"id": 2, "text": "وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ"},
        {"id": 3, "text": "لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ"},
        {"id": 4, "text": "تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ"},
        {"id": 5, "text": "سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ"}
    ],
    "tafsir": [
        {"verses": "1-5", "explanation": "تخبر السورة عن بدء نزول القرآن في ليلة القدر، وهي ليلة عظيمة مباركة، العمل الصالح فيها خير من العمل في ألف شهر ليس فيها ليلة القدر. وفي هذه الليلة، تتنزل الملائكة وجبريل عليه السلام إلى الأرض بكل أمر من الله. وهي ليلة سلام وأمان حتى طلوع الفجر."}
    ],
    "vocabulary": [
        {"id": 1, "word": "لَيْلَةِ الْقَدْرِ", "meaning": "ليلة الشرف والمنزلة العظيمة"},
        {"id": 2, "word": "الرُّوحُ", "meaning": "جبريل عليه السلام"},
        {"id": 3, "word": "مِّن كُلِّ أَمْرٍ", "meaning": "بكل أمر قضاه الله في تلك السنة"},
        {"id": 4, "word": "سَلَامٌ هِيَ", "meaning": "ليلة أمن وسلام لا شر فيها"}
    ]
}
