var surah_99 = {
    "id": 99,
    "name": "الزلزلة",
    "verses": [
        {
            "id": 1,
            "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ إِذَا زُلْزِلَتِ ٱلْأَرْضُ زِلْزَالَهَا"
        },
        {
            "id": 2,
            "text": "وَأَخْرَجَتِ ٱلْأَرْضُ أَثْقَالَهَا"
        },
        {
            "id": 3,
            "text": "وَقَالَ ٱلْإِنسَـٰنُ مَا لَهَا"
        },
        {
            "id": 4,
            "text": "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا"
        },
        {
            "id": 5,
            "text": "بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا"
        },
        {
            "id": 6,
            "text": "يَوْمَئِذٍ يَصْدُرُ ٱلنَّاسُ أَشْتَاتًا لِّيُرَوْا۟ أَعْمَـٰلَهُمْ"
        },
        {
            "id": 7,
            "text": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُۥ"
        },
        {
            "id": 8,
            "text": "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُۥ"
        }
    ],
    "tafsir": [
        {
            "verses": "1-8",
            "explanation": "تصف السورة أهوال يوم القيامة، فإذا زلزلت الأرض زلزالاً شديدًا، وأخرجت ما في بطنها من كنوز وأموات، وتساءل الإنسان في فزع: ما الذي حدث لها؟ في ذلك اليوم، ستشهد الأرض على كل ما عُمل عليها، لأن الله أمرها بذلك. وسيخرج الناس من قبورهم متفرقين ليروا جزاء أعمالهم. فمن عمل خيرًا ولو كان صغيرًا جدًا سيراه، ومن عمل شرًا ولو كان صغيرًا جدًا سيراه."
        }
    ],
    "vocabulary": [
        {
            "id": 1,
            "word": "زِلْزَالَهَا",
            "meaning": "تحركها الشديد"
        },
        {
            "id": 2,
            "word": "أَثْقَالَهَا",
            "meaning": "ما في بطنها من الأموات والكنوز"
        },
        {
            "id": 3,
            "word": "أَوْحَىٰ لَهَا",
            "meaning": "أمرها بأن تخبر"
        },
        {
            "id": 4,
            "word": "يَصْدُرُ النَّاسُ",
            "meaning": "يخرج الناس من قبورهم"
        },
        {
            "id": 5,
            "word": "أَشْتَاتًا",
            "meaning": "متفرقين"
        },
        {
            "id": 6,
            "word": "مِثْقَالَ ذَرَّةٍ",
            "meaning": "وزن نملة صغيرة، وهو كناية عن أصغر شيء"
        }
    ]
};